In [13]:
import pandas as pd

In [14]:
dataset = pd.read_csv("./Social_Network_Ads.csv")
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [15]:
dataset.drop("User ID", axis=1, inplace=True)
dataset.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [16]:
Y = dataset.iloc[:,3]
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [17]:
X = dataset.iloc[:,0:3]
X.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [18]:
sex = pd.get_dummies(X["Gender"],drop_first=True)
sex.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [19]:
X = pd.concat([X,sex], axis=1)
X.head()

   Gender  Age  EstimatedSalary  Male
0    Male   19            19000     1
1    Male   35            20000     1
2  Female   26            43000     0
3  Female   27            57000     0
4    Male   19            76000     1

In [20]:
X.drop("Gender",axis=1, inplace=True)
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [21]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size = 1/3, random_state = 42)

In [43]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(criterion='entropy',n_estimators=301, random_state = 42)
classifier.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='entropy',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=301, n_jobs=1,
            oob_score=False, random_state=42, verbose=0, warm_start=False)

In [44]:
predictions = classifier.predict(X_test)

In [45]:
from sklearn.metrics import classification_report
classification_report(predictions, y_test)

'             precision    recall  f1-score   support\n\n          0       0.93      0.94      0.93        80\n          1       0.91      0.89      0.90        54\n\navg / total       0.92      0.92      0.92       134\n'

In [46]:
from sklearn.metrics import confusion_matrix
confusion_matrix(predictions,y_test)

array([[75,  5],
       [ 6, 48]])

In [47]:
from sklearn.metrics import accuracy_score
accuracy_score(predictions, y_test) * 100

91.7910447761194